"use client";
import { logout } from "@/lib/auth";
import { useRouter } from "next/navigation";

export default function LogoutButton() {
    const router = useRouter();

    async function handleLogout() {
        await logout();
        router.push("/login"); // Перенаправлення на сторінку логіну
    }

    return (
        <div className="icon-link" onClick={handleLogout}>
            <svg xmlns="http://www.w3.org/2000/svg" version="1.1" x="0px" y="0px" viewBox="0 0 100 100" enableBackground="new 0 0 100 100">
                <g>
                    <g>
                        <path d="M64.9,51.9c-2.9-4.9-7.2-8.7-12.3-11.1c-3.7,2.4-8.1,3.8-12.8,3.8c-4.8,0-9.2-1.4-12.9-3.8c-9.6,4.4-16.2,14.1-16.2,25.3     v7.5c0,2.7,2.1,4.8,4.8,4.8h28c0-0.5,0-0.9,0-1.4C43.4,64.3,52.8,53.8,64.9,51.9z"/>
                        <path d="M39.8,39.6c10.2,0,18.5-8.3,18.5-18.5c0-10.2-8.3-18.5-18.5-18.5c-10.2,0-18.5,8.3-18.5,18.5     C21.2,31.3,29.5,39.6,39.8,39.6z"/>
                        <path d="M68.9,56.6c-11.3,0-20.5,9.2-20.5,20.5s9.2,20.5,20.5,20.5S89.3,88.3,89.3,77S80.1,56.6,68.9,56.6z M68.9,92.5     c-8.5,0-15.5-6.9-15.5-15.5s6.9-15.5,15.5-15.5S84.3,68.5,84.3,77S77.4,92.5,68.9,92.5z"/>
                        <path d="M79.3,75.3l-6.1-6.1c-1-1-2.6-1-3.5,0c-1,1-1,2.6,0,3.5l1.8,1.8H60.2c-1.4,0-2.5,1.1-2.5,2.5c0,1.4,1.1,2.5,2.5,2.5h11.2     l-1.8,1.8c-1,1-1,2.6,0,3.5c0.5,0.5,1.1,0.7,1.8,0.7c0.6,0,1.3-0.2,1.8-0.7l6.1-6.1C80.3,77.8,80.3,76.2,79.3,75.3z"/>
                    </g>
                </g>
            </svg>
        </div>
    )
}